---
kind: type
id: T:Autodesk.Revit.UI.IExternalApplication
source: html/196c8712-71de-03e8-b30d-a9625bd626d2.htm
---
# Autodesk.Revit.UI.IExternalApplication

An interface that supports addition of external applications to Revit.

## Syntax (C#)
```csharp
public interface IExternalApplication
```

## Remarks
External applications are permitted to customize the Revit UI, and to add events
and updaters to the session.